-----------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\miche\OneDrive\Documenti\USA\School\SPRING 2023\Research Design Implementation\ppol768-spring23\I
> ndividual Assignments\Giunti Michele\week-08\w08Assignment.log
  log type:  text
 opened on:  20 Mar 2023, 14:00:00

. do "C:\Users\miche\OneDrive\Documenti\USA\School\SPRING 2023\Research Design Implementation\ppol768-spring23\Individu
> al Assignments\Giunti Michele\week-08\w08Assignment.do"

. ********************************************************************************
. * PPOL 768: Week 5
. * Assignment for Week 8
. * Michele Giunti
. * March 21st, 2023
. ********************************************************************************
. 
. /*Note: I am copying and pasting the format because it is easier,
> All this code is original
> */
. clear

. /*******************************************************************************
> 1. Sampling noise in a fixed population
> *******************************************************************************/
. cd "C:\Users\miche\OneDrive\Documenti\USA\School\SPRING 2023\Research Design Implementation\ppol768-spring23\Individu
> al Assignments\Giunti Michele\week-08"
C:\Users\miche\OneDrive\Documenti\USA\School\SPRING 2023\Research Design Implementation\ppol768-spring23\Individual Ass
> ignments\Giunti Michele\week-08

. drop _all

. set obs 10000
Number of observations (_N) was 0, now 10,000.

. 
. set seed 69420

. gen x = rnormal()

. 
. save "C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design Implementation/ppol768-spring23/Indivi
> dual Assignments/Giunti Michele/week-08/sims1.dta", replace
file C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design
    Implementation/ppol768-spring23/Individual Assignments/Giunti Michele/week-08/sims1.dta saved

. set seed 69420

. capture program drop v1 

. program define v1, rclass
  1. syntax anything [if]
  2. clear
  3. use "C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design Implementation/ppol768-spring23/Indi
> vidual Assignments/Giunti Michele/week-08/sims1.dta"
  4. args number_sample 
  5. sample `number_sample', count
  6. gen y = 3*x + rnormal()
  7. regress y x
  8. mat a = r(table)
  9. return scalar N = e(N)
 10. return scalar beta = a[1,1]
 11. return scalar se = a[2,1]
 12. return scalar p = a[4,1]
 13. return scalar lower = a[5,1]
 14. return scalar upper = a[6,1]
 15. 
. end

. 
. tempfile sims1

. tempfile combined 

. clear

. 
. save `combined', replace emptyok
(dataset contains 0 observations)
(file C:\Users\miche\AppData\Local\Temp\ST_7f58_000009.tmp not found)
file C:\Users\miche\AppData\Local\Temp\ST_7f58_000009.tmp saved as .dta format

. forvalues i = 1/4{
  2.         local sample = 10^`i'
  3.         qui simulate beta = r(beta) se = r(se) lower = r(lower) upper = r(upper) p = r(p), reps(500) seed(69420) :
>  v1 `sample'
  4.         gen table=`i'
  5.         append using `combined'
  6.         qui save `combined', replace
  7.         _dots `i' 0
  8. }
....
. save `sims1', replace
(file C:\Users\miche\AppData\Local\Temp\ST_7f58_000008.tmp not found)
file C:\Users\miche\AppData\Local\Temp\ST_7f58_000008.tmp saved as .dta format

. 
. use `sims1' , clear
(simulate: v1)

. label define SAMPLE 1 "10" 2 "100" 3 "1000" 4 "10000"

. label values table SAMPLE

. 
. bysort table : tabstat beta se lower upper, col(stats) s(mean sem max min)

-----------------------------------------------------------------------------------------------------------------------
-> table = 10

    Variable |      Mean  se(mean)       Max       Min
-------------+----------------------------------------
        beta |  3.015689   .017076  4.143707  1.573174
          se |  .3572803  .0060215  .9489551  .0975507
       lower |  2.191799  .0222757  3.511289  .1340007
       upper |  3.839579  .0217393  5.578012  2.531216
------------------------------------------------------

-----------------------------------------------------------------------------------------------------------------------
-> table = 100

    Variable |      Mean  se(mean)       Max       Min
-------------+----------------------------------------
        beta |  3.006408  .0046549  3.341442  2.708015
          se |  .1009933  .0004607  .1449233  .0719212
       lower |   2.80599  .0047544  3.151526   2.47916
       upper |  3.206826  .0047334  3.569879  2.914071
------------------------------------------------------

-----------------------------------------------------------------------------------------------------------------------
-> table = 1000

    Variable |      Mean  se(mean)       Max       Min
-------------+----------------------------------------
        beta |  2.999415  .0013729  3.104433  2.911755
          se |  .0316935  .0000428  .0347336   .028668
       lower |  2.937222  .0013815  3.046619   2.85219
       upper |  3.061609  .0013694   3.16297   2.97132
------------------------------------------------------

-----------------------------------------------------------------------------------------------------------------------
-> table = 10000

    Variable |      Mean  se(mean)       Max       Min
-------------+----------------------------------------
        beta |  3.001858  .0020544         4  2.971514
          se |  .0100267  3.17e-06  .0102467  .0098084
       lower |  2.980203  .0004697  3.014031  2.951888
       upper |  3.019512  .0004694  3.053619  2.991141
------------------------------------------------------

. 
. label variable beta "Beta"

. label variable se "Standard Deviation"

. label variable lower "Lower CI"

. label variable upper "Upper CI"

. label variable p "p-value"

. 
. estpost tabstat beta se lower upper, by(table) col(stats) s(mean sem max min)

Summary statistics: mean semean max min
     for variables: beta se lower upper
  by categories of: table

       table |   e(mean)  e(semean)     e(max)     e(min) 
-------------+--------------------------------------------
10           |                                            
        beta |  3.015689    .017076   4.143707   1.573174 
          se |  .3572803   .0060215   .9489551   .0975507 
       lower |  2.191799   .0222757   3.511289   .1340007 
       upper |  3.839579   .0217393   5.578012   2.531216 
-------------+--------------------------------------------
100          |                                            
        beta |  3.006408   .0046549   3.341442   2.708015 
          se |  .1009933   .0004607   .1449233   .0719212 
       lower |   2.80599   .0047544   3.151526    2.47916 
       upper |  3.206826   .0047334   3.569879   2.914071 
-------------+--------------------------------------------
1000         |                                            
        beta |  2.999415   .0013729   3.104433   2.911755 
          se |  .0316935   .0000428   .0347336    .028668 
       lower |  2.937222   .0013815   3.046619    2.85219 
       upper |  3.061609   .0013694    3.16297    2.97132 
-------------+--------------------------------------------
10000        |                                            
        beta |  3.001858   .0020544          4   2.971514 
          se |  .0100267   3.17e-06   .0102467   .0098084 
       lower |  2.980203   .0004697   3.014031   2.951888 
       upper |  3.019512   .0004694   3.053619   2.991141 
-------------+--------------------------------------------
Total        |                                            
        beta |  3.005843   .0044665   4.143707   1.573174 
          se |   .125056   .0034419   .9489551   .0098084 
       lower |  2.728678   .0090952   3.511289   .1340007 
       upper |  3.282013   .0092396   5.578012   2.531216 

. esttab using "C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design Implementation/ppol768-spring2
> 3/Individual Assignments/Giunti Michele/week-08/tab/tabstatpart1.tex", replace style(tex) cells("mean semean max min"
> ) label nodepvar nomtitle nonumber collabels("Mean" "SEM" "Max" "Min")
(output written to C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design Implementation/ppol768-spri
> ng23/Individual Assignments/Giunti Michele/week-08/tab/tabstatpart1.tex)

. 
. tw (histogram beta, by(table) lc(none) fc(gray) freq width(.1) barwidth(.1))(histogram beta if p < .00001, lc(black) 
> fc(none) freq width(.1) barwidth(.1) legend(order(1 "Beta" 2 "p < 0.05")))

. graph export "C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design Implementation/ppol768-spring2
> 3/Individual Assignments/Giunti Michele/week-08/img/betadeviationpart1.png", replace
file C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design
    Implementation/ppol768-spring23/Individual Assignments/Giunti Michele/week-08/img/betadeviationpart1.png saved as
    PNG format

. 
. graph bar (mean) se, over(table) ytitle("Mean of Standard Error") title("Differences in Variance per Sample Size") su
> btitle("Reductions in Variance Experienced by Different Sample Sizes")

. graph export "C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design Implementation/ppol768-spring2
> 3/Individual Assignments/Giunti Michele/week-08/img/SEMpart1.png" ,replace
file C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design
    Implementation/ppol768-spring23/Individual Assignments/Giunti Michele/week-08/img/SEMpart1.png saved as PNG
    format

. 
. graph bar (sd) beta upper lower, over(table) legend( label(1 "Beta") label(2 "Upper CI") label(3 "Lower CI") ) ytitle
> ("Standard Deviation") title("Differences in Variance per Sample Size") subtitle("Reductions in Variance Experienced 
> by Different Sample Sizes")

. graph export "C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design Implementation/ppol768-spring2
> 3/Individual Assignments/Giunti Michele/week-08/img/CIBetapart1.png" , replace
file C:/Users/miche/OneDrive/Documenti/USA/School/SPRING 2023/Research Design
    Implementation/ppol768-spring23/Individual Assignments/Giunti Michele/week-08/img/CIBetapart1.png saved as PNG
    format

. 
. save sims1, replace
file sims1.dta saved

. ******************************************************************************
. *2. Sampling noise in an infinite superpopulation
. *******************************************************************************/
. clear

. drop _all

. 
. set seed 69420

. capture program drop v2

. program define v2, rclass
  1. syntax anything [if]
  2. clear
  3. args number_sample 
  4. set obs `number_sample'
  5. gen x = rnormal()
  6. gen y = 3*x + rnormal()
  7. regress y x
  8. mat a = r(table)
  9. return scalar N = e(N)
 10. return scalar beta = a[1,1]
 11. return scalar se = a[2,1]
 12. return scalar p = a[4,1]
 13. return scalar lower = a[5,1]
 14. return scalar upper = a[6,1]
 15. end

. 
. tempfile sims2

. tempfile combined1

. tempfile combined2

. save `sims2', replace emptyok
(dataset contains 0 observations)
(file C:\Users\miche\AppData\Local\Temp\ST_7f58_00000a.tmp not found)
file C:\Users\miche\AppData\Local\Temp\ST_7f58_00000a.tmp saved as .dta format

. clear

. 
. save `combined1', replace emptyok
(dataset contains 0 observations)
(file C:\Users\miche\AppData\Local\Temp\ST_7f58_00000b.tmp not found)
file C:\Users\miche\AppData\Local\Temp\ST_7f58_00000b.tmp saved as .dta format

. forvalues i = 1/6{
  2.         local population = 10^`i'
  3.         qui simulate beta = r(beta) se = r(se) lower = r(lower) upper = r(upper) p = r(p), reps(500) seed(69420) :
>  v1 `population'
  4.         gen table1=`i'
  5.         qui replace table1=10^`i'
  6.         append using `combined1'
  7.         qui save `combined1', replace
  8.         _dots `i' 0
  9. }
x not found
an error occurred when simulate executed v1
r(111);

end of do-file

r(111);

. log close
      name:  <unnamed>
       log:  C:\Users\miche\OneDrive\Documenti\USA\School\SPRING 2023\Research Design Implementation\ppol768-spring23\I
> ndividual Assignments\Giunti Michele\week-08\w08Assignment.log
  log type:  text
 closed on:  20 Mar 2023, 14:03:35
-----------------------------------------------------------------------------------------------------------------------
